Revit 2027 API
ExportLayerTable.Remove Method
 Removes the pair (key, info) by pattern key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Remove(
	ExportLayerKey exportLayerKey
)
Public Sub Remove (
	exportLayerKey As ExportLayerKey
)
public:
void Remove(
	ExportLayerKey^ exportLayerKey
)
member Remove :
        exportLayerKey : ExportLayerKey -> unit
Parameters
exportLayerKey ExportLayerKey
 The export pattern key.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLayerTable Class
Autodesk.Revit.DB Namespace